02_Modelagem_UML_Astah/UC12_Atribuir_XP_Moedas/README.md
```mermaid
sequenceDiagram
    autonumber
    participant S as :Sistema
    participant G as :SistemaGamificacao
    participant A as :Aluno
    S->>G: concluirTarefa()
    G->>G: calcular()
    G->>A: creditarXP(100)
    G-->>S: Ok
```
