PIM_III/02_Modelagem_UML_Astah/UC12_Atribuir_XP_Moedas/UC12_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant S as ":Sistema"
participant G as ":SistemaGamificacao"
participant A as ":Aluno"
S -> G : concluirTarefa()
G -> G : calcular()
G -> A : creditarXP(100)
G --/ S : Ok
@enduml
